app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token]) # grabs session token from header using session object
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "bh86yu3ZHoKVDXQaT7qm2bCC0AQb0hbLzVT/l51AX5fbH9C+3HeFLSJXE/GQi9dRptQuL9WRs+LPJMk+yLbVPA=="], ["LIMIT", 1]]