app/controllers/servers_controller.rb

SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        server= Server.find_by(id: params[:id])

INSERT INTO "servers" ("name", "owner_id", "members", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "server739405"], ["owner_id", 3], ["members", "{3}"], ["created_at", "2021-08-17 00:24:37.849440"], ["updated_at", "2021-08-17 00:24:37.849440"]]
INSERT INTO "members" ("user_id", "server_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["server_id", 2], ["created_at", "2021-08-19 01:25:24.735704"], ["updated_at", "2021-08-19 01:25:24.735704"]]
---
    def create
        # create a new server using parameters that are obligatory in strong
        # params
        @server = Server.new(server_params)
        if @server.save!
            Member.create({:server_id => @server.id, :user_id => @server.owner_id})