app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
def index
    # render json: User.all
    # calling a fxn on the model would be CAPITALIZED

    @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
def show
    # localhost:3000/users/userID
    # used to show a certain/specific user; showing one of the users
    # render json: {userid: params[:id]}

    # where(id: 2)[0]
    # user = User.where(id: params[:id])[0]
    # User.where returns an array since it's a search function
    # in show, we are looking for ONE thing

    # when finding a single thing, do find_by. it does NOT return an array :)
    user = User.find_by(id: params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password" = $2, "email" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["username", "spongeBob"], ["password", "patrickstar200"], ["email", "iamsquid@yahoo.com"], ["updated_at", "2021-06-02 01:57:54.433770"], ["id", 1]]
---
def update
    user = User.find_by(id: params[:id])
    if user.update(user_params)