app/models/user.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "p+bb9TPtC4s6APwcMcny3l0xjxnW+OpcuO7wv5jBUduXkuzee5mHtj9G0kzN5iqSX90KVPLUZR+fGLFNcmrJVg=="], ["updated_at", "2021-06-29 04:23:24.757480"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom.base64(64) # SecureRandom::urlsafe_base64
        self.save

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def password=(password)
        # when instance var is created with @, it will run the validations on it
        @password = password
        self.password_digest = BCrypt::Password.create(password)